In [10]:
import pandas as pd

In [11]:
records = {
    'id': [100, 102, 103],
    'name': ["Shafeeq", "Lucy", "John"],
    'marks': [29, 49, 100]
}

In [12]:
df = pd.DataFrame(records)

In [13]:
print(df)

    id     name  marks
0  100  Shafeeq     29
1  102     Lucy     49
2  103     John    100

In [14]:
print(df.describe())

               id       marks
count    3.000000    3.000000
mean   101.666667   59.333333
std      1.527525   36.610563
min    100.000000   29.000000
25%    101.000000   39.000000
50%    102.000000   49.000000
75%    102.500000   74.500000
max    103.000000  100.000000

In [15]:
print(df.columns)

Index(['id', 'name', 'marks'], dtype='object')

In [16]:
df.columns = ["RegistrationNumber", "StudentName", "ExamMarks"]

In [17]:
print(df)

   RegistrationNumber StudentName  ExamMarks
0                 100     Shafeeq         29
1                 102        Lucy         49
2                 103        John        100

In [18]:
print(df.head())

   RegistrationNumber StudentName  ExamMarks
0                 100     Shafeeq         29
1                 102        Lucy         49
2                 103        John        100

In [19]:
df[2:]

   RegistrationNumber StudentName  ExamMarks
2                 103        John        100

In [22]:
df = pd.read_csv("Sales_Records.csv")
df

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Middle East and North Africa,Libya,Cosmetics,Offline,M,10/18/2014,686800706,10/31/2014,8446,437.20,263.33,3692591.20,2224085.18,1468506.02
1,North America,Canada,Vegetables,Online,M,11/07/2011,185941302,12/08/2011,3018,154.06,90.93,464953.08,274426.74,190526.34
2,Middle East and North Africa,Libya,Baby Food,Offline,C,10/31/2016,246222341,12/09/2016,1517,255.28,159.42,387259.76,241840.14,145419.62
3,Asia,Japan,Cereal,Offline,C,04/10/2010,161442649,05/12/2010,3322,205.70,117.11,683335.40,389039.42,294295.98
4,Sub-Saharan Africa,Chad,Fruits,Offline,H,8/16/2011,645713555,8/31/2011,9845,9.33,6.92,91853.85,68127.40,23726.45
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,Middle East and North Africa,Azerbaijan,Snacks,Offline,C,4/18/2010,534085166,4/25/2010,6524,152.58,97.44,995431.92,635698.56,359733.36
996,Europe,Georgia,Baby Food,Offline,H,08/01/2011,590768182,09/07/2011,288,255.28,159.42,73520.64,45912.96,27607.68
997,Middle East and North Africa,United Arab Emirates,Vegetables,Online,C,05/12/2011,524363124,6/28/2011,9556,154.06,90.93,1472197.36,868927.08,603270.28
998,Europe,Finland,Household,Offline,L,1/25/2016,289606320,2/14/2016,9801,668.27,502.54,6549714.27,4925394.54,1624319.73
999,Europe,Portugal,Cereal,Offline,C,04/10/2014,811546599,05/08/2014,3528,205.70,117.11,725709.60,413164.08,312545.52